
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       5 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                            |
|:--------:|:-------------------------------------------------------------------------------------|
|    🟢     | `module.tags-override-tester.aws_iam_policy.pytest-permissions`                      |
|    🟢     | `module.tags-override-tester.aws_iam_policy.role-permissions`                        |
|    🟢     | `module.tags-override-tester.aws_iam_role.role-tester`                               |
|    🟢     | `module.tags-override-tester.aws_iam_role_policy_attachment.role-permissions`        |
|    🟢     | `module.tags-override-tester.aws_iam_role_policy_attachment.role-pytest-permissions` |
|    🟡     | `aws_iam_role.omnibus`                                                               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.omnibus will be updated in-place
  ~ resource "aws_iam_role" "omnibus" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "AROAXFXZRL24D5JYG6IBW",
                                "arn:aws:iam::990466748045:user/aleks",
                              + "arn:aws:iam::493370826424:role/infrahouse-toolkit-github",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "omnibus"
        name                  = "omnibus"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.tags-override-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pytest-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.tags-override-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "tags-override-tester-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.tags-override-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-tags-override:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-tags-override"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tags-override-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.tags-override-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tags-override-tester"
    }

  # module.tags-override-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tags-override-tester"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDUsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDB9fQ==
```
</details>